phoenix-rtos/phoenix-rtos-lwip/drivers/stm32-eth.c
/*
 * Phoenix-RTOS --- networking stack
 *
 * STM32 ETH network module driver
 *
 * Copyright 2018, 2024, 2026 Phoenix Systems
 * Author: Michał Mirosław, Julian Uziembło, Jacek Maksymowicz
 *
 * %LICENSE%
 */


#include "arch/cc.h"
#include "lwip/etharp.h"
#include "lwip/netif.h"
#include "netif-driver.h"
#include "bdring.h"
#include "ephy.h"
#include "physmmap.h"
#include "res-create.h"

#include <sys/interrupt.h>
#include <sys/platform.h>
#include <sys/threads.h>
#include <stdatomic.h>
#include <endian.h>
#include <errno.h>
#include <stdarg.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <stm32l4-multi.h>
#include <string.h>
#include <unistd.h>

#include "stm32-gpio.h"
#include "stm32-eth-regs.h"

#include <board_config.h>

#if defined(__CPU_STM32N6)
#include <phoenix/arch/armv8m/stm32/n6/stm32n6.h>

#define N_ETH   1
#define N_PCTLS 4
#else
#error "Unsupported platform"
#endif


#define WIP_UNFINISHED 0 /* TODO: this is so that MDIO communication can be tested */
/* Note: names starting with "ETH" have been fully adapted for STM32 ETH peripheral, while names starting with ENET
 * are more-or-less copy-pasted from imxrt implementation */
/* TODO: remove the #pragma region for final release */

#define ETH_DEBUG      1
#define MDIO_TIMEOUT   0
#define MDIO_DEBUG     0
#define ENET_SELFTEST  0 /* TODO: self-test functionality has not been ported to STM32N6! Decide later if it should be re-implemented or deleted. */
#define EPHY_BOARD_REV 0 /* TODO: I'm not sure what this is for, for now hardcoded to 0 */

#define ETH_MAX_PKT_SZ           1536 /* Receive buffer length (must be a multiple of 4) */
#define ETH_ENABLE_FLOW_CONTROL  true
#define ETH_PROMISC_MODE         false
#define ETH_ENABLE_RX_PAD_REMOVE true
#define ETH_RX_RING_SIZE         4
#define ETH_TX_RING_SIZE         4

#define MAIN_DMA_RX_CHANNEL 0UL
#define RESET_TIMEOUT_US    500000U

#define eth_printf(state, fmt, ...) printf("lwip: ETH%u: " fmt "\n", state->devnum, ##__VA_ARGS__)

#if ETH_DEBUG
#define eth_debug_printf(state, fmt, ...) eth_printf(state, fmt, ##__VA_ARGS__)
#else
#define eth_debug_printf(state, fmt, ...)
#endif

#define CHECK(x) \
	do { \
		int _ret = x; \
		if (_ret < 0) { \
			return _ret; \
		} \
	} while (0)

#define CHECK_MSG(x, state, ...) \
	do { \
		int _ret = x; \
		if (_ret < 0) { \
			eth_printf(state, ##__VA_ARGS__); \
			return _ret; \
		} \
	} while (0)


typedef struct {
	int16_t port; /* < 0 indicates pin not present */
	uint8_t pin;
	int8_t afMode; /* < 0 indicates pin works as GPIO, use STM32_PIN_SETUP_* */
} stm32_pin_setup_t;


#define eth_phymode_mii   0
#define eth_phymode_rmii  1
#define eth_phymode_rgmii 2

/*
 * Note: the numbering of eth_rmii_* and eth_rgmii_* enums has been chosen so that
 * corresponding RMII and RGMII pins have the same value. This may be useful in the future.
 */
enum {
	eth_rmii_ref_clk,
	eth_rmii_crs_dv,
	eth_rmii_tx_en,
	eth_rmii_txd0,
	eth_rmii_txd1,
	eth_rmii_rxd0,
	eth_rmii_rxd1,
	eth_rmii_pins,
};


enum {
	eth_rgmii_rx_clk,
	eth_rgmii_rx_ctl,
	eth_rgmii_tx_ctl,
	eth_rgmii_txd0,
	eth_rgmii_txd1,
	eth_rgmii_rxd0,
	eth_rgmii_rxd1,
	eth_rgmii_gtx_clk,
	eth_rgmii_clk125,
	eth_rgmii_txd2,
	eth_rgmii_txd3,
	eth_rgmii_rxd2,
	eth_rgmii_rxd3,
	eth_rgmii_pins,
};

typedef union {
	stm32_pin_setup_t rmii[eth_rmii_pins];
	stm32_pin_setup_t rgmii[eth_rgmii_pins];
} eth_pinout_t;

/* Pins common for all modes */
enum {
	eth_phy_mdc = 0U,
	eth_phy_mdio,
	eth_phy_intn,
	eth_phy_pins,
};

#ifndef ETH1_RX_REFCLK_INTERNAL
#define ETH1_RX_REFCLK_INTERNAL 1
#endif

#ifndef ETH1_TX_REFCLK_INTERNAL
#define ETH1_TX_REFCLK_INTERNAL 1
#endif

#ifndef ETH1_CLK_OUTPUT
#define ETH1_CLK_OUTPUT 0
#endif

#if defined(ETH1_MODE_RMII) && !defined(ETH1_MODE_RGMII) && !defined(ETH1_MODE_MII)
#define ETH1_PHYMODE eth_phymode_rmii
#elif defined(ETH1_MODE_RGMII) && !defined(ETH1_MODE_RMII) && !defined(ETH1_MODE_MII)
#define ETH1_PHYMODE eth_phymode_rgmii
#elif defined(ETH1_MODE_MII) && !defined(ETH1_MODE_RMII) && !defined(ETH1_MODE_RGMII)
#error "MII mode not supported yet"
#else
#error "Must define exactly one of ETH1_MODE_RMII, ETH1_MODE_RGMII or ETH1_MODE_MII"
#endif


static const struct {
	addr_t base;
	int irq;
	int pctls[N_PCTLS];
	stm32_pin_setup_t pinoutPhy[eth_phy_pins]; /* Pinout for PHY management and interrupts */
	stm32_pin_setup_t pinClk;
	eth_pinout_t pinout;
	unsigned int phyMode;
	unsigned int macOtpFuses[2]; /* Low and high OTP fuse containing MAC address */
	int ipclkMode;               /* PCTL for selecting MII/RMII/RGMII mode */
	int ipclkClksel;             /* PCTL for selecting ck_ker_ethX clock */
	int ipclkRxRefclk;           /* PCTL for selecting internal/external RX reference clock */
	int ipclkTxRefclk;           /* PCTL for selecting internal/external TX reference clock */
	uint32_t hclkFreqHz;         /* eth_hclk, also called "CSR clock" in docs. */
	uint8_t clksel;              /* Selection of source for ck_ker_ethX, */
	bool rxRefclkInternal;       /* RX reference clock source: external pin or internally generated */
	bool txRefclkInternal;       /* TX reference clock source: external pin or internally generated */
} eth_setup[N_ETH] = {
#if defined(__CPU_STM32N6)
	{
		.base = 0x58036000UL,
		.irq = eth1_irq,
		.pctls = { pctl_eth1, pctl_eth1mac, pctl_eth1tx, pctl_eth1rx },
		.pinoutPhy = {
			[eth_phy_mdc] = { ETH1_MDC_PORT, ETH1_MDC_PIN, 11 },
			[eth_phy_mdio] = { ETH1_MDIO_PORT, ETH1_MDIO_PIN, 11 },
#ifdef ETH1_PHY_INTN_PORT
			[eth_phy_intn] = { ETH1_PHY_INTN_PORT, ETH1_PHY_INTN_PIN, 11 },
#else
			[eth_phy_intn] = { -1, 0, 0 },
#endif
		},
#if ETH1_CLK_OUTPUT
		.pinClk = { gpiof, 5, 11 },
#else
		.pinClk = { -1, 0, 0 },
#endif
		.pinout = {
#if ETH1_PHYMODE == eth_phymode_rmii
			.rmii = {
#if ETH1_RX_REFCLK_INTERNAL == 0
				[eth_rmii_ref_clk] = { ETH1_REF_CLK_PORT, ETH1_REF_CLK_PIN, 11 },
#else
				[eth_rmii_ref_clk] = { -1, 0, 0 },
#endif
				[eth_rmii_crs_dv] = { gpiof, 10, 11 },
				[eth_rmii_tx_en] = { gpiof, 11, 11 },
				[eth_rmii_txd0] = { gpiof, 12, 11 },
				[eth_rmii_txd1] = { gpiof, 13, 11 },
				[eth_rmii_rxd0] = { gpiof, 14, 11 },
				[eth_rmii_rxd1] = { gpiof, 15, 11 },
			},
#elif ETH1_PHYMODE == eth_phymode_rgmii
			.rgmii = {
#if ETH1_RX_REFCLK_INTERNAL == 0
				[eth_rgmii_rx_clk] = { gpiof, 7, 11 },
#else
				[eth_rgmii_rx_clk] = { -1, 0, 0 },
#endif
				[eth_rgmii_rx_ctl] = { gpiof, 10, 11 },
				[eth_rgmii_tx_ctl] = { gpiof, 11, 11 },
				[eth_rgmii_txd0] = { gpiof, 12, 11 },
				[eth_rgmii_txd1] = { gpiof, 13, 11 },
				[eth_rgmii_rxd0] = { gpiof, 14, 11 },
				[eth_rgmii_rxd1] = { gpiof, 15, 11 },
				[eth_rgmii_gtx_clk] = { gpiof, 0, 12 },
#if ETH1_TX_REFCLK_INTERNAL == 0
				[eth_rgmii_clk125] = { gpiof, 2, 11 },
#else
				[eth_rgmii_clk125] = { -1, 0, 0 },
#endif
				[eth_rgmii_txd2] = { gpiog, 3, 11 },
				[eth_rgmii_txd3] = { gpiog, 4, 11 },
				[eth_rgmii_rxd2] = { gpiof, 8, 11 },
				[eth_rgmii_rxd3] = { gpiof, 9, 11 },

