phoenix-rtos/phoenix-rtos-lwip/drivers/stm32-eth.c
			}
#else
#error "ETH1_PHYMODE has invalid value"
#endif
		},
		.phyMode = ETH1_PHYMODE,
		.macOtpFuses = { 169, 170 },
		.ipclkMode = pctl_ipclk_eth1sel,
		.ipclkClksel = pctl_ipclk_eth1clksel,
		.ipclkRxRefclk = pctl_ipclk_eth1refclksel,
		.ipclkTxRefclk = pctl_ipclk_eth1gtxclksel,
		.hclkFreqHz = 200U * 1000U * 1000U, /* TODO: acquire from multidriver */
		.clksel = 0u,                       /* HCLK selected as reference clock */
		.rxRefclkInternal = (ETH1_RX_REFCLK_INTERNAL != 0),
		.txRefclkInternal = (ETH1_TX_REFCLK_INTERNAL != 0),
	},
#endif
};

typedef struct {
	volatile uint32_t descr[4];
	uint32_t addr0;
	uint32_t addr1;
} eth_desc_t;


typedef struct {
	volatile uint32_t *base;

	struct netif *netif;

#define PRIV_RESOURCES(s) &(s)->irq_lock, 3, ~0x03
	handle_t irq_lock, tx_lock;

	handle_t irq_cond, irq_handle;

	union {
		struct {
			net_bufdesc_ring_t rx, tx;
		};
		net_bufdesc_ring_t rings[2];
	};

	size_t devnum;
	oid_t multidrvOid;
	eth_phy_state_t phy;

#if ENET_SELFTEST
	struct {
#define SELFTEST_RESOURCES(s) &(s)->selfTest.rx_lock, 2, ~0x1
		handle_t rx_lock;
		handle_t rx_cond;
		unsigned int rx_valid; /* -1: received invalid packet, 0: no packet received, 1: received valid packet */
	} selfTest;
#endif

	uint32_t irq_stack[1024] __attribute__((aligned(16)));
} enet_state_t;


static int stm32_pinConfigMulti(const oid_t *dev, const stm32_pin_setup_t *pins, size_t nPins)
{
	for (size_t i = 0; i < nPins; i++) {
		if (pins[i].port < 0) {
			continue;
		}

		CHECK(stm32_pinConfig(dev, pins[i].port, pins[i].pin, pins[i].afMode));
	}

	return 0;
}


static int stm32_getOTP(unsigned int word, unsigned int *out)
{
	platformctl_t pctl;
	pctl.action = pctl_get;
	pctl.type = pctl_otp;
	pctl.otp.addr = word;
	pctl.otp.val = 0; /* Will be overwritten on success */

	CHECK(platformctl(&pctl));
	*out = pctl.otp.val;
	return 0;
}


static int eth_reset(enet_state_t *state, size_t idx, time_t timeout)
{
	time_t now, when;

	eth_debug_printf(state, "Resetting device...");

	gettime(&now, NULL);
	when = now + timeout;
	/* trigger and wait for reset */

	state->base[eth_dmamr] |= ETH_DMAMR_SWR;
	asm volatile("dsb" ::: "memory"); /* TODO: HAL? */
	while (1) {
		if ((state->base[eth_dmamr] & ETH_DMAMR_SWR) == 0) {
			break;
		}

		usleep(1000);
		if (timeout != 0) {
			gettime(&now, NULL);
			if (now >= when) {
				eth_printf(state, "Couldn't reset device: timeout");
				return -ETIMEDOUT;
			}
		}
	}

	eth_debug_printf(state, "Reset done.");

	state->base[eth_mac1ustcr] = (eth_setup[idx].hclkFreqHz / (1000U * 1000U)) - 1;
	/* TODO: do any other initialization? */

	return 0;
}


static void enet_start(enet_state_t *state, size_t idx)
{
	uint32_t v;
	v = state->base[eth_maccr];
	v &= ~(
			ETH_MACCR_PRELEN_MASK |
			ETH_MACCR_DC | /* Disable deferral check */
			ETH_MACCR_BL_MASK |
			ETH_MACCR_DR |
			ETH_MACCR_DCRS |
			ETH_MACCR_DO |
			ETH_MACCR_ECRSFD |
			ETH_MACCR_LM | /* Disable loopback */
			ETH_MACCR_JE | /* Disable jumbo packet */
			ETH_MACCR_JD | /* Enable jabber */
			ETH_MACCR_BE |
			ETH_MACCR_WD | /* Enable watchdog (cut off RX at 2048 bytes) */
			ETH_MACCR_ACS |
			ETH_MACCR_CST |
			ETH_MACCR_S2KP |
			ETH_MACCR_GPSLCE);

	/* Select default link speed and duplex */
	v |= ETH_MACCR_DM;
	switch (eth_setup[idx].phyMode) {
		case eth_phymode_rgmii:
			v &= ~(ETH_MACCR_FES | ETH_MACCR_PS); /* 1 Gbps mode */
			break;

		case eth_phymode_rmii: /* Fall-through */
		case eth_phymode_mii:
			v |= ETH_MACCR_FES | ETH_MACCR_PS; /* 100 Mbps mode */
			break;

		default:
			/* Should never happen */
			break;
	}

	v |= 0 << ETH_MACCR_PRELEN_SHIFT; /* 7 bytes of preamble */
	v |= 0 << ETH_MACCR_BL_SHIFT;     /* Back-off limited to 2^10 slot delays */
	v |= ETH_ENABLE_RX_PAD_REMOVE ? ETH_MACCR_ACS : 0;
	v |= ETH_MACCR_IPC; /* Enable checksum offload TODO: is this okay? */
	state->base[eth_maccr] = v;

	v = state->base[eth_macecr];
	v &= ~(ETH_MACECR_EIPG_MASK | ETH_MACECR_EIPGEN | ETH_MACECR_USP | ETH_MACECR_SPEN | ETH_MACECR_DCRCC | ETH_MACECR_GPSL_MASK);
	v |= (1560 << ETH_MACECR_GPSL_SHIFT) & ETH_MACECR_GPSL_MASK; /* Set giant packet size limit (not used unless ETH_MACCR_GPSLCE is set) */
	state->base[eth_macecr] = v;

	v = state->base[eth_macwtr];
	v &= ~(ETH_MACWTR_WTO_MASK | ETH_MACWTR_PWE); /* Disable programmable watchdog */
	state->base[eth_macwtr] = v;

	v = state->base[eth_macpfr];
	v &= ~ETH_MACPFR_PR;
	v |= ETH_PROMISC_MODE ? ETH_MACPFR_PR : 0;
	state->base[eth_macpfr] = v;

	v = state->base[eth_macrxfcr];
	v &= ~(ETH_MACRXFCR_UP | ETH_MACRXFCR_RFE);
	v |= ETH_ENABLE_FLOW_CONTROL ? ETH_MACRXFCR_RFE : 0;
	state->base[eth_macrxfcr] = v;

	v = state->base[eth_macq0txfcr];
	v &= ~(ETH_MACQ0TXFCR_PT_MASK | ETH_MACQ0TXFCR_DZPQ | ETH_MACQ0TXFCR_PLT_MASK | ETH_MACQ0TXFCR_TFE);
	v |= ETH_ENABLE_FLOW_CONTROL ? (ETH_MACQ0TXFCR_DZPQ | ETH_MACQ0TXFCR_TFE) : 0;
	state->base[eth_macq0txfcr] = v;

#if WIP_UNFINISHED
	state->mmio->MRBR = ENET_MAX_PKT_SZ;
	state->mmio->FTRL = BIT(14) - 1;  // FIXME: truncation to just above link MTU

	uint32_t rcr = ENET_RCR_MAX_FL_NO_VLAN_VAL << ENET_RCR_MAX_FL_SHIFT |
			ENET_RCR_CRCFWD | ENET_RCR_PAUFWD;

	state->mmio->RACC =
#if ETH_PAD_SIZE == 2
			ENET_RACC_SHIFT16 |
#elif ETH_PAD_SIZE != 0
#error "Unsupported ETH_PAD_SIZE"
#endif
			ENET_RACC_PADREM;

#if ETH_PAD_SIZE == 2
	state->mmio->TACC = ENET_TACC_SHIFT16;
#elif ETH_PAD_SIZE == 0
	state->mmio->TACC = 0;
#else
#error "Unsupported ETH_PAD_SIZE"
#endif

	state->mmio->TCR = ENET_TCR_FDEN;

	mutexLock(state->irq_lock);
	state->mmio->EIMR |= ENET_IRQ_EBERR;
	mutexUnlock(state->irq_lock);

	state->mmio->ECR = ENET_ECR_MAGIC_VAL |
#if ENET_USE_ENHANCED_DESCRIPTORS
			ENET_ECR_EN1588 |
#endif
#if __BYTE_ORDER == __LITTLE_ENDIAN
			ENET_ECR_DBSWP |
#endif
			ENET_ECR_ETHEREN;

	/* trigger HW RX */
	state->mmio->RDAR = ENET_RDAR_RDAR;
	state->base[eth_maccr] |= ETH_MACCR_TE | ETH_MACCR_RE;
#endif
}


static void eth_showCardId(enet_state_t *state)
{
	uint8_t *mac = (void *)&state->netif->hwaddr;
	eth_printf(state, "initialized, MAC=%02x:%02x:%02x:%02x:%02x:%02x", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
}


static size_t enet_nextRxBufferSize(const net_bufdesc_ring_t *ring, size_t i)
{
#if WIP_UNFINISHED
	volatile enet_buf_desc_t *desc = (volatile enet_buf_desc_t *)ring->ring + i;
	size_t sz;

	if ((desc->flags & ENET_DESC_RDY) != 0) {
		return 0;
	}

