phoenix-rtos/phoenix-rtos-lwip/drivers/stm32-eth.c
	sz = desc->len;
	if (sz == 0) {  // FIXME: hw bug?
		sz = 1;
		printf("lwip: enet: WARNING: This message indicates a potential HW bug:\n");
		printf("lwip: enet: HW provided invalid size: %zu. Setting size to 1\n", sz);
	}

	return sz;
#else
	return 0;
#endif
}


static bool enet_pktRxFinished(const net_bufdesc_ring_t *ring, size_t i)
{
#if WIP_UNFINISHED
	volatile enet_buf_desc_t *desc = (volatile enet_buf_desc_t *)ring->ring + i;

	return ((desc->flags & ENET_DESC_LAST) != 0u);
#else
	return false;
#endif
}


static void enet_fillRxDesc(const net_bufdesc_ring_t *ring, size_t i, addr_t pa, size_t sz, unsigned seg)
{
#if WIP_UNFINISHED
	volatile enet_buf_desc_t *desc = (volatile enet_buf_desc_t *)ring->ring + i;
	unsigned wrap = desc == (volatile enet_buf_desc_t *)ring->ring + ring->last ? ENET_DESC_WRAP : 0;

	desc->len = sz - ETH_PAD_SIZE;
	desc->addr = pa;

	atomic_thread_fence(memory_order_seq_cst);
	desc->flags = ENET_DESC_RDY | wrap;
	atomic_thread_fence(memory_order_seq_cst);
#endif
}


static bool enet_nextTxDone(const net_bufdesc_ring_t *ring, size_t i)
{
#if WIP_UNFINISHED
	volatile enet_buf_desc_t *desc = (volatile enet_buf_desc_t *)ring->ring + i;

	return ((desc->flags & ENET_DESC_RDY) == 0u);
#else
	return true;
#endif
}


static void enet_fillTxDesc(const net_bufdesc_ring_t *ring, size_t i, addr_t pa, size_t sz, unsigned seg)
{
#if WIP_UNFINISHED
	volatile enet_buf_desc_t *desc = (volatile enet_buf_desc_t *)ring->ring + i;
	unsigned flags;

	flags = ENET_DESC_RDY | ENET_TXD_TXCRC;
	flags |= (i == ring->last) ? ENET_DESC_WRAP : 0;
	flags |= ((seg & BDRING_SEG_LAST) != 0) ? ENET_DESC_LAST : 0;

	desc->len = sz;
	desc->addr = pa;


	atomic_thread_fence(memory_order_seq_cst);
	desc->flags = flags;
	atomic_thread_fence(memory_order_seq_cst);
#endif
}


static const net_bufdesc_ops_t enet_ring_ops = {
	.nextRxBufferSize = enet_nextRxBufferSize,
	.pktRxFinished = enet_pktRxFinished,
	.fillRxDesc = enet_fillRxDesc,
	.nextTxDone = enet_nextTxDone,
	.fillTxDesc = enet_fillTxDesc,
	.desc_size = sizeof(eth_desc_t),
	.pkt_buf_sz = ETH_MAX_PKT_SZ,
	.ring_alignment = 64,
	.max_tx_frag = 0xFFFF,
};

static const size_t enet_ring_sizes[] = { ETH_RX_RING_SIZE, ETH_TX_RING_SIZE };


static int enet_initRings(enet_state_t *state)
{
	int err;

	err = net_initRings(state->rings, enet_ring_sizes, sizeof(state->rings) / sizeof(*state->rings), &enet_ring_ops);
	if (err != 0) {
		return err;
	}
#if WIP_UNFINISHED
	state->mmio->RDSR = state->rx.phys;
	state->mmio->TDSR = state->tx.phys;
#endif
	return 0;
}


static int enet_irqHandler(unsigned irq, void *arg)
{
#if WIP_UNFINISHED
	uint32_t events;
	enet_state_t *state = arg;

	events = state->mmio->EIR & (ENET_IRQ_RXF | ENET_IRQ_TXF | ENET_IRQ_EBERR);
	state->mmio->EIMR &= ~(ENET_IRQ_RXF | ENET_IRQ_TXF);

	if ((events & ENET_IRQ_EBERR) != 0) {
		atomic_fetch_or(&state->drv_exit, EV_BUS_ERROR);
	}
#endif

	return 0;
}


static void enet_irqThread(void *arg)
{
	enet_state_t *state = arg;
#if WIP_UNFINISHED
	size_t rx_done = 0;
	unsigned exit;

	mutexLock(state->irq_lock);
	exit = atomic_load(&state->drv_exit);
	while (exit == 0) {
		state->mmio->EIR = ENET_IRQ_RXF;
		rx_done = net_receivePackets(&state->rx, state->netif);
		if (rx_done > 0 || net_rxFullyFilled(&state->rx) == 0) {
			net_refillRx(&state->rx);
			state->mmio->RDAR = ENET_RDAR_RDAR;
		}

		state->mmio->EIR = ENET_IRQ_TXF;
		net_reapTxFinished(&state->tx);

		if ((state->mmio->EIR & (ENET_IRQ_RXF | ENET_IRQ_TXF)) == 0) {
			state->mmio->EIMR |= ENET_IRQ_RXF | ENET_IRQ_TXF;
			condWait(state->irq_cond, state->irq_lock, 0);
		}
		exit = atomic_load(&state->drv_exit);
	}
	mutexUnlock(state->irq_lock);

	if ((exit & EV_BUS_ERROR) != 0) {
		eth_printf(state, "HW signalled memory bus error -- device halted");
	}
#else
	for (;;) {
		sleep(1);
		/* TODO: according to docs "This bit is set when rising edge is detected on the ETH_PHY_INTN input."
		 * In other words it appears they intend interrupts to be active high instead of active low...
		 * There's very little documentation about it, we may end up just polling the pin with GPIO
		 * or maybe use EXTI interrupt. */
		if ((state->base[eth_macisr] & ETH_MACISR_PHYIS) != 0) {
			ephy_macInterrupt(&state->phy);
		}
		else {
			printf("no irq\n");
		}
	}
#endif

	endthread();
}

static err_t eth_netifOutput(struct netif *netif, struct pbuf *p)
{
	enet_state_t *state = netif->state;
	size_t nf;

	if (ETH_PAD_SIZE != 2) {
		(void)pbuf_header(p, -ETH_PAD_SIZE); /* drop the padding word */
	}

	mutexLock(state->tx_lock);
	nf = net_transmitPacket(&state->tx, p);
	if (nf != 0) {
#if WIP_UNFINISHED
		state->mmio->TDAR = ENET_TDAR_TDAR;
#endif
	}
	mutexUnlock(state->tx_lock);

	return nf ? ERR_OK : ERR_BUF;
}


#pragma region mdio


static int eth_mdioSetup(void *arg, unsigned max_khz, unsigned min_hold_ns, unsigned opt_preamble)
{
	enet_state_t *state = arg;
	size_t idx = state->devnum - 1U;
	uint32_t v = state->base[eth_macmdioar];
	v &= ~(0xf << 8);

	/*
	 * Only consider the lower 8 options for dividers. Other options result in higher clock rates
	 * which may not be supported by PHY. And yes, on the hardware level the options are not sorted...
	 */
	static const struct {
		uint16_t divider;
		uint8_t val;
	} options[8] = {
		{ 16U, 2 },
		{ 26U, 3 },
		{ 42U, 0 },
		{ 62U, 1 },
		{ 102U, 4 },
		{ 124U, 5 },
		{ 204U, 6 },
		{ 324U, 7 },
	};

	uint32_t maxHz = max_khz * 1000U;
	uint32_t i;
	for (i = 0; i < 8; i++) {
		if ((eth_setup[idx].hclkFreqHz / options[i].divider) <= maxHz) {
			v |= (uint32_t)options[i].val << 8;
			break;
		}
	}

	if (i == 8) {
		eth_printf(state, "Cannot find an appropriate divider for MDC clock (base freq %u)", eth_setup[idx].hclkFreqHz);
		return -EIO;
	}

	/* Configuring hold time doesn't seem to be supported in hardware */
	(void)min_hold_ns;

	v &= ~ETH_MACMDIOAR_PSE;
	if (opt_preamble != 0) {
		v |= ETH_MACMDIOAR_PSE; /* Suppress preamble (only 1 bit of preamble will be transmitted) */
	}

	state->base[eth_macmdioar] = v;
	return 0;
}


static int eth_mdioWait(enet_state_t *state, time_t timeout)
{
	if (timeout != 0) {
		time_t now, when;
		gettime(&now, NULL);
		when = now + timeout;

		while ((state->base[eth_macmdioar] & ETH_MACMDIOAR_GB) != 0) {
			gettime(&now, NULL);
			if (now >= when) {
				eth_debug_printf(state, "eth_mdioWait: timeout");
				return -ETIMEDOUT;
			}

