phoenix-rtos/phoenix-rtos-lwip/drivers/stm32-eth.c
			usleep(10);
		}
	}
	else {
		while ((state->base[eth_macmdioar] & ETH_MACMDIOAR_GB) != 0) {
			/* Wait for transaction to finish */
		}
	}

	return 0;
}


static uint16_t eth_mdioIO(enet_state_t *state, unsigned addr, unsigned reg, unsigned val, bool write)
{
	const char *opString = write ? "WRITE" : "READ";
#if MDIO_DEBUG
	eth_printf(state, "mdio: op %s, addr=0x%08x, reg=0x%08x, val=0x%04x", opString, addr, reg, val);
#endif

	uint32_t ar = state->base[eth_macmdioar];
	uint32_t dr = (val & 0xffffU);

	ar &= ~(ETH_MACMDIOAR_GOC | ETH_MACMDIOAR_RDA_MASK | ETH_MACMDIOAR_PA_MASK);
	ar |= write ? ETH_MACMDIOAR_GOC_WRITE : ETH_MACMDIOAR_GOC_READ;
	if ((addr & NETDEV_MDIO_CLAUSE45) != 0) {
		/* clause 45 */
		ar |= ETH_MACMDIOAR_C45E;
		uint32_t device = addr & NETDEV_MDIO_A_MASK;
		uint32_t phy = (addr & NETDEV_MDIO_B_MASK) >> 8;
		ar |= (phy << ETH_MACMDIOAR_PA_SHIFT) & ETH_MACMDIOAR_PA_MASK;
		ar |= (device << ETH_MACMDIOAR_RDA_SHIFT) & ETH_MACMDIOAR_RDA_MASK;
		dr |= (reg & 0xffffU);
	}
	else {
		/* clause 22 */
		ar &= ~ETH_MACMDIOAR_C45E;
		ar |= (addr << ETH_MACMDIOAR_PA_SHIFT) & ETH_MACMDIOAR_PA_MASK;
		ar |= (reg << ETH_MACMDIOAR_RDA_SHIFT) & ETH_MACMDIOAR_RDA_MASK;
	}

	state->base[eth_macmdioar] = ar;
	state->base[eth_macmdiodr] = dr;
	state->base[eth_macmdioar] = ar | ETH_MACMDIOAR_GB;
	if (eth_mdioWait(state, MDIO_TIMEOUT) < 0) {
		eth_printf(state, "WARN: MDIO %s operation timeout", opString);
	}

	val = write ? 0U : (state->base[eth_macmdiodr] & 0xffffU);
	return val;
}


static uint16_t eth_mdioRead(void *arg, unsigned addr, uint16_t reg)
{
	enet_state_t *state = arg;
	return eth_mdioIO(state, addr, reg, 0, false);
}


static void eth_mdioWrite(void *arg, unsigned addr, uint16_t reg, uint16_t val)
{
	enet_state_t *state = arg;
	(void)eth_mdioIO(state, addr, reg, val, true);
}


static const mdio_bus_ops_t eth_mdio_ops = {
	eth_mdioSetup,
	eth_mdioRead,
	eth_mdioWrite,
};


#pragma endregion mdio


static void eth_setLinkState(void *arg, int state)
{
	struct netif *netif = arg;
	enet_state_t *priv = netif->state;
	uint32_t v;
	int speed, duplex;

	if (state != 0) {
		speed = ephy_linkSpeed(&priv->phy, &duplex);
		v = priv->base[eth_maccr];
		v &= ~(ETH_MACCR_DM | ETH_MACCR_FES);
		v |= duplex != 0 ? ETH_MACCR_DM : 0;
		if (speed == 1000) {
			v &= ~ETH_MACCR_PS;
		}
		else {
			v |= ETH_MACCR_PS;
			v |= (speed == 100) ? ETH_MACCR_FES : 0;
		}

		priv->base[eth_maccr] = v;
		netif_set_link_up(netif);
	}
	else {
		netif_set_link_down(netif);
	}
}


const char *eth_media(struct netif *netif)
{
	int full_duplex, speed;
	enet_state_t *state;
	state = netif->state;

	speed = ephy_linkSpeed(&state->phy, &full_duplex);

	switch (speed) {
		case 0:
			return "unspecified";
		case 10:
			if (full_duplex != 0) {
				return "10Mbps/full-duplex";
			}
			else {
				return "10Mbps/half-duplex";
			}
		case 100:
			if (full_duplex != 0) {
				return "100Mbps/full-duplex";
			}
			else {
				return "100Mbps/half-duplex";
			}
		case 1000:
			if (full_duplex != 0) {
				return "1000Mbps/full-duplex";
			}
			else {
				return "1000Mbps/half-duplex";
			}
		default:
			return "unrecognized";
	}
}


#pragma region selftest
#if ENET_SELFTEST
#define _TP_DST     "dddddd"
#define _TP_SRC     "ssssss"
#define _TP_ETHTYPE "\x05\xDD" /* eth frame type 0x05DD is undefined */
#define _TP_10DIG   "0123456789"
#define TEST_PACKET _TP_DST _TP_SRC _TP_ETHTYPE \
		_TP_10DIG _TP_10DIG _TP_10DIG _TP_10DIG _TP_10DIG _TP_10DIG _TP_10DIG
#define TEST_PACKET_LEN (sizeof((TEST_PACKET)) - 1)


/* self-test RX input function */
static err_t enet_testNetifInput(struct pbuf *p, struct netif *netif)
{
	uint8_t buf[TEST_PACKET_LEN]; /* used only if pbuf is fragmented (should not happen) */
	enet_state_t *state = netif->state;

	bool is_valid_pkt = true;

	/* verify contents */
	if (p->len != (TEST_PACKET_LEN + ETH_PAD_SIZE)) {
		eth_debug_printf(state, "self-test RX: invalid packet length");
		eth_debug_printf(state, "expected: %uB", (TEST_PACKET_LEN + ETH_PAD_SIZE));
		eth_debug_printf(state, "actual:   %uB", p->len);
		is_valid_pkt = false;
	}
	uint8_t *data = pbuf_get_contiguous(p, buf, sizeof(buf), TEST_PACKET_LEN, ETH_PAD_SIZE);
	if (data == NULL || memcmp(TEST_PACKET, data, TEST_PACKET_LEN) != 0) {
#if ETH_DEBUG
		if (data == NULL) {
			data = p->payload;
		}
		eth_printf(state, "self-test RX: invalid packet contents");

		eth_printf(state, "expected:");
		for (int i = 0; i < TEST_PACKET_LEN; i++) {
			if (i != 0 && i % 16 == 0) {
				printf("\n");
			}
			printf("%02x ", TEST_PACKET[i]);
		}
		printf("\n");

		eth_printf(state, "actual:");
		for (int i = 0; i < p->len; i++) {
			if (i != 0 && i % 16 == 0) {
				printf("\n");
			}
			printf("%02x ", data[i]);
		}
		printf("\n");
#endif
		is_valid_pkt = false;
	}
	pbuf_free(p);

	mutexLock(state->selfTest.rx_lock);
	state->selfTest.rx_valid = is_valid_pkt ? 1 : -1;
	mutexUnlock(state->selfTest.rx_lock);
	condBroadcast(state->selfTest.rx_cond);

	return ERR_OK;
}


/* MACPHY self-test procedure (internal loopback) */
static int enet_phySelfTest(struct netif *netif)
{
	enet_state_t *state = netif->state;
	int err;
	bool was_addins_set;

	eth_printf(state, "Start enet phy tx/rx selftest");

	err = create_mutexcond_bulk(SELFTEST_RESOURCES(state));
	if (err != 0) {
		return err;
	}

	/* setup self-test (local loopback mode & force linkup) */
	if (ephy_enableLoopback(&state->phy, true) < 0) {
		ephy_enableLoopback(&state->phy, false);
		resourceDestroy(state->selfTest.rx_cond);
		resourceDestroy(state->selfTest.rx_lock);
		return -1;
	}

	/* enable promisicious mode to allow invalid MAC in pseudo-ETH test packet */
	state->mmio->RCR |= ENET_RCR_PROM;

	/* disable MAC address addition on TX */
	was_addins_set = (state->mmio->TCR & ENET_TCR_ADDINS) != 0;
	state->mmio->TCR &= ~ENET_TCR_ADDINS;

	/* enable MIB counters (mmio->stats) + clear stats */
	state->mmio->MIBC = 0;
	state->mmio->MIBC |= ENET_MIBC_MIB_CLEAR;
	state->mmio->MIBC &= ~ENET_MIBC_MIB_CLEAR;

	/* override netif->input */
	netif_input_fn old_input = netif->input;
	netif->input = &enet_testNetifInput;

	int ret = 0;
	do {
		struct pbuf *p = pbuf_alloc(PBUF_RAW, TEST_PACKET_LEN + ETH_PAD_SIZE, PBUF_RAM);
		memset(p->payload, 0, ETH_PAD_SIZE);
		pbuf_take_at(p, TEST_PACKET, TEST_PACKET_LEN, ETH_PAD_SIZE);

		/* try to send and receive packets */
		mutexLock(state->selfTest.rx_lock);
		state->selfTest.rx_valid = 0;
		if (eth_netifOutput(netif, p) != ERR_OK) { /* frees pbuf internally */
			eth_printf(state, "failed to send test packet");
			ret = -1;
			mutexUnlock(state->selfTest.rx_lock);
			break;
		}

		err = 0;
		while ((err != -ETIME) && (state->selfTest.rx_valid == 0)) {
			/* TX -> RX takes ~4ms, wait for 100ms just to be sure */
			err = condWait(state->selfTest.rx_cond, state->selfTest.rx_lock, 100 * 1000);
		}
		mutexUnlock(state->selfTest.rx_lock);

		eth_debug_printf(state, "stats: TX: PACKETS=%u CRC_ALIGN=%u OK=%u",
				state->mmio->stats.RMON_T_PACKETS,
				state->mmio->stats.RMON_T_CRC_ALIGN,
				state->mmio->stats.IEEE_T_FRAME_OK);

		eth_debug_printf(state, "stats: RX: PACKETS=%u CRC_ALIGN=%u OK=%u",
				state->mmio->stats.RMON_R_PACKETS,
				state->mmio->stats.RMON_R_CRC_ALIGN,
				state->mmio->stats.IEEE_R_FRAME_OK);

