phoenix-rtos/phoenix-rtos-lwip/drivers/stm32-eth.c
		if ((err < 0) || (state->selfTest.rx_valid != 1)) {
			eth_debug_printf(state, "Test failed: state->selfTest.rx_valid=%d, %s (%d)",
					state->selfTest.rx_valid, strerror(-err), err);
			ret = -1;
		}

		/* successfully received */
	} while (0);

	/* restore normal mode */
	netif->input = old_input;
	state->mmio->RCR &= ~ENET_RCR_PROM;
	if (was_addins_set) {
		state->mmio->TCR |= ENET_TCR_ADDINS;
	}
	state->mmio->MIBC = ENET_MIBC_MIB_DIS;
	ephy_enableLoopback(&state->phy, false);

	/* destroy selftest resources */
	resourceDestroy(state->selfTest.rx_cond);
	resourceDestroy(state->selfTest.rx_lock);

	return ret;
}
#endif
#pragma endregion selftest


#pragma region initialization


static int eth_initMDIO(enet_state_t *state, size_t idx)
{
	CHECK_MSG(
			stm32_pinConfigMulti(&state->multidrvOid, eth_setup[idx].pinoutPhy, eth_phy_pins),
			state, "Couldn't configure MDIO pins");


	return 0;
}


/*
 * Enable clocks and set up clock muxes for ETH module
 */
static int eth_clockEnable(enet_state_t *state, size_t idx)
{
	platformctl_t pctl;
	pctl.action = pctl_set;
	pctl.type = pctl_ipclk;
	pctl.ipclk.ipclk = eth_setup[idx].ipclkMode;
	switch (eth_setup[idx].phyMode) {
		case eth_phymode_mii: pctl.ipclk.setting = 0U; break;
		case eth_phymode_rmii: pctl.ipclk.setting = 4U; break;
		case eth_phymode_rgmii: pctl.ipclk.setting = 1U; break;
		default: return -EINVAL;
	}

	CHECK(platformctl(&pctl));

	pctl.ipclk.ipclk = eth_setup[idx].ipclkClksel;
	pctl.ipclk.setting = eth_setup[idx].clksel;
	CHECK(platformctl(&pctl));

	if (eth_setup[idx].phyMode == eth_phymode_rgmii) {
		pctl.ipclk.ipclk = eth_setup[idx].ipclkTxRefclk;
		pctl.ipclk.setting = eth_setup[idx].txRefclkInternal ? 1u : 0u;
		CHECK(platformctl(&pctl));
	}

	pctl.ipclk.ipclk = eth_setup[idx].ipclkRxRefclk;
	pctl.ipclk.setting = eth_setup[idx].rxRefclkInternal ? 1u : 0u;
	CHECK(platformctl(&pctl));

	pctl.action = pctl_set;
	pctl.type = pctl_devclk;
	pctl.devclk.state = 1u;
	pctl.devclk.lpState = 1u;
	for (size_t i = 0; i < N_PCTLS; i++) {
		if (eth_setup[idx].pctls[i] < 0) {
			continue;
		}

		pctl.devclk.dev = eth_setup[idx].pctls[i];
		CHECK_MSG(platformctl(&pctl), state, "Couldn't enable ENET clocks");
	}

	return 0;
}


/*
 * Set pin config for the required ENET module
 */
static int eth_pinConfig(enet_state_t *state, size_t idx)
{
	CHECK(stm32_pinConfigMulti(&state->multidrvOid, &eth_setup[idx].pinClk, 1));
	switch (eth_setup[idx].phyMode) {
		case eth_phymode_rmii:
			return stm32_pinConfigMulti(&state->multidrvOid, eth_setup[idx].pinout.rmii, eth_rmii_pins);

		case eth_phymode_rgmii:
			return stm32_pinConfigMulti(&state->multidrvOid, eth_setup[idx].pinout.rgmii, eth_rgmii_pins);

		case eth_phymode_mii:
			return -ENOTSUP;

		default: /* Should never happen */
			return -EINVAL;
	}

	return 0;
}


static int eth_setupMacAddr(enet_state_t *state, size_t idx)
{
	uint8_t *mac = (void *)&state->netif->hwaddr;
	unsigned int low, high;
	CHECK(stm32_getOTP(eth_setup[idx].macOtpFuses[0], &low));
	CHECK(stm32_getOTP(eth_setup[idx].macOtpFuses[1], &high));
	if ((low == 0) && (high == 0)) {
		eth_printf(state, "WARN: MAC address stored in eFuses is invalid, using default address");
		low = 0x04050607U;
		high = 0x0203U; /* Bit 2 of first octet marks it as a locally administered address */
	}

	mac[0] = (high >> 8) & 0xff;
	mac[1] = (high >> 0) & 0xff;
	mac[2] = (low >> 24) & 0xff;
	mac[3] = (low >> 16) & 0xff;
	mac[4] = (low >> 8) & 0xff;
	mac[5] = (low >> 0) & 0xff;
	state->base[eth_maca0hr] = (1UL << 31) | (MAIN_DMA_RX_CHANNEL << 16) | (high & 0xFFFF);
	state->base[eth_maca0lr] = low;
	return 0;
}


static int eth_initDevice(enet_state_t *state, unsigned long devnum, bool mdio)
{
	// FIXME: cleanup on error
	if ((devnum < 1) || (devnum > N_ETH)) {
		return -ENODEV;
	}

	state->devnum = devnum;
	size_t idx = devnum - 1U;
	int err;

	/* TODO: configurable timeout */
	for (size_t i = 0; i < 100; i++) {
		err = lookup(STM32_MULTI_PATH, NULL, &state->multidrvOid);
		if (err < 0) {
			usleep(100 * 1000);
		}
		else {
			break;
		}
	}

	CHECK_MSG(err, state, "Failed to find multidriver");

	state->base = physmmap(eth_setup[idx].base, 0x1400);
	if (state->base == MAP_FAILED) {
		eth_printf(state, "eth_initDevice: no memory");
		return -ENOMEM;
	}

	CHECK(create_mutexcond_bulk(PRIV_RESOURCES(state)));
	CHECK(eth_clockEnable(state, idx));
	eth_debug_printf(state, "Enabled clock");
	/* ETH reset will fail unless all (incl. external) clocks are provided - so configure pins first */
	CHECK_MSG(
			eth_pinConfig(state, idx),
			state, "Couldn't configure pins: %s (%d)", strerror(-_ret), _ret);
	eth_debug_printf(state, "Pins configured");
	CHECK(eth_reset(state, idx, RESET_TIMEOUT_US));
	CHECK(eth_setupMacAddr(state, idx));

	if (mdio) {
		CHECK(eth_initMDIO(state, idx));
		eth_debug_printf(state, "Initialized MDIO");
	}

	CHECK(enet_initRings(state));
	eth_debug_printf(state, "Initialized ENET Rings");
	eth_debug_printf(state, "mmio 0x%p irq %d", state->base, eth_setup[idx].irq);

	CHECK_MSG(
			interrupt(eth_setup[idx].irq, enet_irqHandler, state, state->irq_cond, &state->irq_handle),
			state, "Couldn't register interrupt handler: %s (%d)", strerror(-_ret), _ret);
	eth_debug_printf(state, "Interrupt handler initialized successfully");

	CHECK_MSG(beginthread(enet_irqThread, 4, state->irq_stack, sizeof(state->irq_stack), state),
			state, "Couldn't begin interrupt thread: %s (%d)", strerror(-_ret), _ret);

	if (mdio) {
		CHECK_MSG(
				register_mdio_bus(&eth_mdio_ops, state),
				state, "Can't register MDIO bus:  %s (%d)", strerror(-_ret), _ret);
		eth_debug_printf(state, "MDIO bus registered");
	}

	net_refillRx(&state->rx);
	enet_start(state, idx);

	eth_showCardId(state);

	return 0;
}


/* ARGS: eth:n[:no-mdio][:PHY:[model:][bus.]addr[:config]] */
static int eth_netifInit(struct netif *netif, char *cfg)
{
	enet_state_t *state;
	char *p;
	int err;
	bool mdio = true;

	netif->linkoutput = eth_netifOutput;
	state = netif->state;
	state->netif = netif;

	if (cfg == NULL) {
		return -EINVAL;
	}

	/* Ethernet peripheral number */
	unsigned long devnum = strtoul(cfg, &p, 0);
	if (*cfg == '\0' || *p++ != ':') {
		return -EINVAL;
	}

	/* MDIO and PHY opts */
	cfg = NULL;
	while (p != NULL && *p != '\0') {
		cfg = strchr(p, ':');
		if (cfg != NULL) {
			*cfg++ = '\0';
		}

		if (strcmp(p, "no-mdio") == 0) {
			mdio = false;
			p = cfg;
			continue;
		}

		if (strcmp(p, "PHY") == 0) {
			break;
		}

		return -EINVAL;
	}

	err = eth_initDevice(state, devnum, mdio);
	if (err != 0) {
		eth_printf(state, "Failed to initialize ETH");
		return err;
	}
	eth_debug_printf(state, "Initialized ETH");

	if (cfg != NULL) {
		err = ephy_init(&state->phy, cfg, EPHY_BOARD_REV, eth_setLinkState, (void *)state->netif);
		if (err < 0) {
			eth_printf(state, "WARN: PHY init failed: %s (%d)", strerror(-err), err);
			return err;
		}

#if ENET_SELFTEST
		err = enet_phySelfTest(netif);
		if (err < 0) {
			eth_printf(state, "WARN: PHY autotest failed");
		}
		else {
			eth_printf(state, "PHY selftest passed successfully");
		}
#endif
	}

	return 0;
}


#pragma endregion initialization


static netif_driver_t eth_drv = {
	.init = eth_netifInit,
	.state_sz = sizeof(enet_state_t),
	.state_align = _Alignof(enet_state_t),
	.name = "eth",
	.media = eth_media,
};


__constructor__(1000) void register_driver_eth(void)
{
	register_netif_driver(&eth_drv);
}
